# Data Acquisition Exercises

In [179]:
from pydataset import data
from env import get_db_url
from sklearn.model_selection import train_test_split


import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import acquire as aq

#### 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables

In [ ]:
df_iris = data('iris')

In [ ]:
#4a. print the first 3 rows
df_iris.head(3)

In [ ]:
#4b. print the number of rows and columns (shape)
df_iris.shape

In [ ]:
#4c. print the column names
df_iris.columns.values

In [ ]:
#4d. print the data type of each column
df_iris.dtypes

In [ ]:
#4e. print the summary statistics for each of the numeric variables
df_iris.describe()

#### 5. Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

Make sure that the spreadsheet is publicly visible under your sharing settings.

- assign the first 100 rows to a new dataframe, df_google_sheets_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [ ]:
filename = "Deangelo Bowen - jemison_spreadsheet_exercises - Table1_CustDetails.csv"
df_google_sheets = pd.read_csv(filename)

In [ ]:
#5a. 
df_google_sheets_sample = df_google_sheets.head(100)

In [ ]:
#5b. 
df_google_sheets.shape

# 7049 rows, 13 columns

In [ ]:
#5c 
df_google_sheets.columns.values[0:5]

In [ ]:
df_google_sheets.dtypes

In [ ]:
#5d
list(df_google_sheets.select_dtypes(['object']))

In [ ]:
#5e
math = df_google_sheets.select_dtypes(['float64'])
math.max() - math.min()

#### 6. Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [ ]:
filename = "Deangelo Bowen - jemison_spreadsheet_exercises.xlsx"
df_excel = pd.read_excel(filename)

#6a
df_excel_sample = df_excel.head(100)
df_excel_sample

In [ ]:
#6b
df_excel.shape

#7049 rows, 26 columns

In [ ]:
#6c
df_excel.columns.values[0:5]

In [ ]:
#6d
list(df_excel.select_dtypes(['object']))

In [ ]:
#6e 
math = df_excel.select_dtypes(['float64'])
math.max() - math.min()

#### 7. Read the data from this google sheet into a dataframe, df_google.

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [ ]:
# took the url from the data acquisition hyperlink file
sheet_url = "https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357"


csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google= pd.read_csv(csv_export_url)

#7a
df_google.head(3)

In [ ]:
#7b
df_google.shape
#891 rows, #12 columns

In [ ]:
#7c
df_google.columns

In [ ]:
#7d
df_google.info()

In [ ]:
#7e
df_google.describe()

In [ ]:
#7f
df_google.nunique()

# Make a new python module, acquire.py to hold the following data aquisition functions:

#### Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [ ]:
titanic_data = aq.get_titanic_data()
titanic_data.head()

#### Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [ ]:
iris = aq.get_iris_data()
iris.head()

#### Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [ ]:
telco_churn = aq.get_telco_data()
telco_churn.head()

Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

- Done

# Data Preparation Exercises

#### Using the Iris Data:

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

#### 1. Use the function defined in acquire.py to load the iris data.

In [5]:
iris = aq.get_iris_data()
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

#### 2. Drop the species_id and measurement_id columns.

In [ ]:
iris = iris.drop(['species_id', 'measurement_id'], axis = 1)
iris.head()

#### 3. Rename the species_name column to just species.

In [ ]:
iris = iris.rename(columns={'species_name': 'species'})
iris.head()

#### 4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [ ]:
dummy_var = pd.get_dummies(iris[['species']], dummy_na = False, drop_first=True)
dummy_var.head()

In [ ]:
iris = pd.concat([iris, dummy_var], axis = 1)
iris.head()

 #### 5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [6]:
def prep_iris(iris):
    iris = iris.drop(['species_id','measurement_id'], axis = 1)
    iris = iris.rename(columns={'species_name': 'species'})
    dummy_var = pd.get_dummies(iris[['species']], dummy_na = False, drop_first=True)
    iris = pd.concat([iris, dummy_var], axis = 1)
    return iris

In [7]:
# test function
simple_prep = prep_iris(iris)
simple_prep.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0

# Using the Titanic dataset

#### 1. Use the function defined in acquire.py to load the Titanic data.

In [96]:
titanic = aq.get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

#### 2. Drop any unnecessary, unhelpful, or duplicated columns.

In [66]:
# Dropping columns
# dropping any possible duplicate 

titanic = titanic.drop(['pclass', 'passenger_id',
                            'class','deck', 'embarked'], axis= 1)
titanic.drop_duplicates(inplace=True)
titanic

     survived     sex   age  sibsp  parch     fare  embark_town  alone
0           0    male  22.0      1      0   7.2500  Southampton      0
1           1  female  38.0      1      0  71.2833    Cherbourg      0
2           1  female  26.0      0      0   7.9250  Southampton      1
3           1  female  35.0      1      0  53.1000  Southampton      0
4           0    male  35.0      0      0   8.0500  Southampton      1
..        ...     ...   ...    ...    ...      ...          ...    ...
885         0  female  39.0      0      5  29.1250   Queenstown      0
887         1  female  19.0      0      0  30.0000  Southampton      1
888         0  female   NaN      1      2  23.4500  Southampton      0
889         1    male  26.0      0      0  30.0000    Cherbourg      1
890         0    male  32.0      0      0   7.7500   Queenstown      1

[779 rows x 8 columns]

#### 3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [67]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 779 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     779 non-null    int64
 1   sex          779 non-null    object
 2   age          676 non-null    float64
 3   sibsp        779 non-null    int64
 4   parch        779 non-null    int64
 5   fare         779 non-null    float64
 6   embark_town  777 non-null    object
 7   alone        779 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 54.8+ KB

In [68]:
# imputing
titanic['age'] = titanic.age.fillna(titanic.age.mean())
titanic['embark_town'] = titanic.embark_town.fillna('Southampton')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 779 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     779 non-null    int64
 1   sex          779 non-null    object
 2   age          779 non-null    float64
 3   sibsp        779 non-null    int64
 4   parch        779 non-null    int64
 5   fare         779 non-null    float64
 6   embark_town  779 non-null    object
 7   alone        779 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 54.8+ KB

In [69]:
# creating dummy variables
dummy_titanic = pd.get_dummies(titanic[['sex', 'embark_town']],
                              dummy_na = False,
                              drop_first = [True, True])
dummy_titanic.head()

   sex_male  embark_town_Queenstown  embark_town_Southampton
0         1                       0                        1
1         0                       0                        0
2         0                       0                        1
3         0                       0                        1
4         1                       0                        1

In [91]:
# second drop
titanic = titanic.drop(['sex','embark_town'], axis= 1)

In [92]:
titanic = pd.concat([titanic_alt, dummy_titanic], axis = 1)
titanic.head()

,survived,sex,age,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,...,embark_town_Southampton,sex_male,embark_town_Queenstown,embark_town_Southampton,sex_male,embark_town_Queenstown,embark_town_Southampton,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,male,22.0,1,0,7.2500,Southampton,0,1,0,...,1,1,0,1,1,0,1,1,0,1
1,1,female,38.0,1,0,71.2833,Cherbourg,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,female,26.0,0,0,7.9250,Southampton,1,0,0,...,1,0,0,1,0,0,1,0,0,1
3,1,female,35.0,1,0,53.1000,Southampton,0,0,0,...,1,0,0,1,0,0,1,0,0,1
4,0,male,35.0,0,0,8.0500,Southampton,1,1,0,...,1,1,0,1,1,0,1,1,0,1

#### 4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [97]:
def prep_titanic(titanic):
    titanic = titanic.drop(['passenger_id',
                            'class','deck', 'embarked'], axis= 1)
    titanic.drop_duplicates(inplace=True)
    titanic['age'] = titanic.age.fillna(titanic.age.mean())
    titanic['embark_town'] = titanic.embark_town.fillna('Southampton')
    dummy_titanic = pd.get_dummies(titanic[['sex', 'embark_town']],
                              dummy_na = False,
                              drop_first = [True, True])
    titanic = titanic.drop(['sex','embark_town'], axis= 1)
    titanic = pd.concat([titanic, dummy_titanic], axis = 1)
    return titanic

In [119]:
titanic_prepped = prep_titanic(titanic)

In [120]:
titanic_prepped.describe()

,survived,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
count,780.000000,780.000000,780.000000,780.000000,780.000000,780.000000,780.000000,780.000000,780.000000,780.000000
mean,0.412821,2.246154,29.812751,0.525641,0.417949,34.829108,0.566667,0.625641,0.074359,0.726923
std,0.492657,0.854452,13.708828,0.988046,0.838536,52.263440,0.495854,0.484267,0.262523,0.445826
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,1.000000,21.750000,0.000000,0.000000,8.050000,0.000000,0.000000,0.000000,0.000000
50%,0.000000,3.000000,29.812751,0.000000,0.000000,15.950000,1.000000,1.000000,0.000000,1.000000
75%,1.000000,3.000000,36.000000,1.000000,1.000000,34.375000,1.000000,1.000000,0.000000,1.000000
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000,1.000000

# Using the Telco dataset

#### 1. Use the function defined in acquire.py to load the Telco data.

In [200]:
# get telco data
telco = aq.get_telco_data()
telco.head()

,internet_service_type_id,payment_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,payment_type,internet_service_type
0,1,2,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,Mailed check,DSL
1,1,2,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,Mailed check,DSL
2,2,1,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Electronic check,Fiber optic
3,2,1,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Electronic check,Fiber optic
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Mailed check,Fiber optic

# Takeaways
- total charges is an object. Should be a float
- No need for type ids, to inclue customer id
- No need for device protection, tech support, online backup, online security, streaming tv, streaming movies
- no nulls

#### Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [185]:
# drop duplicates
telco.drop_duplicates(inplace=True)

In [186]:
telco = telco.drop(['internet_service_type_id', 'payment_type_id', 'contract_type_id',
                  'customer_id', 'online_security', 'online_backup', 'device_protection',
                  'tech_support', 'streaming_tv', 'streaming_movies'], axis= 1)
telco.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,paperless_billing,monthly_charges,total_charges,churn,contract_type,payment_type,internet_service_type
0,Female,0,Yes,Yes,9,Yes,No,Yes,65.6,593.3,No,One year,Mailed check,DSL
1,Male,0,No,No,9,Yes,Yes,No,59.9,542.4,No,Month-to-month,Mailed check,DSL
2,Male,0,No,No,4,Yes,No,Yes,73.9,280.85,Yes,Month-to-month,Electronic check,Fiber optic
3,Male,1,Yes,No,13,Yes,No,Yes,98.0,1237.85,Yes,Month-to-month,Electronic check,Fiber optic
4,Female,1,Yes,No,3,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Mailed check,Fiber optic

In [187]:
telco['total_charges'] = telco['total_charges'].str.strip()
telco = telco[telco.total_charges != '']
telco['total_charges']= telco.total_charges.astype('float')

#### Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [189]:
# mapping catgs. to numerics
# Yes = 1, No = 0
# idea : creating dummy columns just to drop them and keep numerics == mapping
telco['partner'] = telco.partner.map({'Yes': 1, 'No': 0})
telco['dependents'] = telco.dependents.map({'Yes': 1, 'No': 0})
telco['phone_service'] = telco.phone_service.map({'Yes': 1, 'No': 0})
telco['paperless_billing'] = telco.paperless_billing.map({'Yes': 1, 'No': 0})
telco['churn'] = telco.churn.map({'Yes': 1, 'No': 0})
telco.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,paperless_billing,monthly_charges,total_charges,churn,contract_type,payment_type,internet_service_type
0,Female,0,1,1,9,1,No,1,65.6,593.30,0,One year,Mailed check,DSL
1,Male,0,0,0,9,1,Yes,0,59.9,542.40,0,Month-to-month,Mailed check,DSL
2,Male,0,0,0,4,1,No,1,73.9,280.85,1,Month-to-month,Electronic check,Fiber optic
3,Male,1,1,0,13,1,No,1,98.0,1237.85,1,Month-to-month,Electronic check,Fiber optic
4,Female,1,1,0,3,1,No,1,83.9,267.40,1,Month-to-month,Mailed check,Fiber optic

In [190]:
# create dummy for cat cols
dummy_telco = pd.get_dummies(telco[['gender', 'multiple_lines', 'contract_type',
                                     'payment_type', 'internet_service_type']])

In [191]:
# concat new cols, drop previous 
telco = pd.concat([telco, dummy_telco], axis = 1)
telco.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,paperless_billing,monthly_charges,total_charges,...,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,payment_type_Bank transfer (automatic),payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None
0,Female,0,1,1,9,1,No,1,65.6,593.30,...,0,1,0,0,0,0,1,1,0,0
1,Male,0,0,0,9,1,Yes,0,59.9,542.40,...,1,0,0,0,0,0,1,1,0,0
2,Male,0,0,0,4,1,No,1,73.9,280.85,...,1,0,0,0,0,1,0,0,1,0
3,Male,1,1,0,13,1,No,1,98.0,1237.85,...,1,0,0,0,0,1,0,0,1,0
4,Female,1,1,0,3,1,No,1,83.9,267.40,...,1,0,0,0,0,0,1,0,1,0

### 4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [192]:
# train, split, validate tests, from sklearn.model_selection 
train_validate, test = train_test_split(telco_2, test_size=.2,
                                       random_state=123,
                                       stratify=telco.churn)

train, validate = train_test_split(train_validate, test_size=.3,
                                  random_state=123,
                                  stratify=train_validate.churn)

In [193]:
train.shape

(3937, 59)

In [194]:
test.shape

(1407, 59)

In [195]:
validate.shape

(1688, 59)

In [201]:
# using the split data function from the lesson, and for practice:

def split_telco_data(telco):
    train_validate, test = train_test_split(telco, test_size=.2,
                                           random_state=123,
                                           stratify=telco.churn)
    train,validate = train_test_split(train_validate, test_size=.3,
                                     random_state=123,
                                     stratify=train_validate.churn)
    return train, validate, test

In [203]:
# create the function prep_telco with the split function
def prep_telco(telco):
    
    # drop duplicates
    telco.drop_duplicates(inplace=True)
    
    # drop specific columns
    telco = telco.drop(['internet_service_type_id', 'payment_type_id', 'contract_type_id',
                  'customer_id', 'online_security', 'online_backup', 'device_protection',
                  'tech_support', 'streaming_tv', 'streaming_movies'], axis= 1)
    
    # strip spaces from total charges, turn into a float
    telco['total_charges'] = telco['total_charges'].str.strip()
    telco = telco[telco.total_charges != '']
    telco['total_charges']= telco.total_charges.astype('float')
    
    # map Yes = 1, No = 0
    telco['partner'] = telco.partner.map({'Yes': 1, 'No': 0})
    telco['dependents'] = telco.dependents.map({'Yes': 1, 'No': 0})
    telco['phone_service'] = telco.phone_service.map({'Yes': 1, 'No': 0})
    telco['paperless_billing'] = telco.paperless_billing.map({'Yes': 1, 'No': 0})
    telco['churn'] = telco.churn.map({'Yes': 1, 'No': 0})
    
    # create dummy for cat cols to numeric cols
    dummy_telco = pd.get_dummies(telco[['gender', 'multiple_lines', 'contract_type',
                                     'payment_type', 'internet_service_type']])
    
    # concat
    telco = pd.concat([telco, dummy_telco], axis = 1)
    
    # train validate test
    train, validate, test = split_telco_data(telco)
    
    return train, validate, test

In [204]:
# observe train validate test
train, validate, test = prep_telco(telco)

In [205]:
train.info()
# no nulls, check

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3937 entries, 5919 to 4192
Data columns (total 29 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   gender                                  3937 non-null   object
 1   senior_citizen                          3937 non-null   int64
 2   partner                                 3937 non-null   int64
 3   dependents                              3937 non-null   int64
 4   tenure                                  3937 non-null   int64
 5   phone_service                           3937 non-null   int64
 6   multiple_lines                          3937 non-null   object
 7   paperless_billing                       3937 non-null   int64
 8   monthly_charges                         3937 non-null   float64
 9   total_charges                           3937 non-null   float64
 10  churn                                   3937 non-null   int64
 11  contract_type                           3937 non-null   object
 12  payment_type                            3937 non-null   object
 13  internet_service_type                   3937 non-null   object
 14  gender_Female                           3937 non-null   uint8
 15  gender_Male                             3937 non-null   uint8
 16  multiple_lines_No                       3937 non-null   uint8
 17  multiple_lines_No phone service         3937 non-null   uint8
 18  multiple_lines_Yes                      3937 non-null   uint8
 19  contract_type_Month-to-month            3937 non-null   uint8
 20  contract_type_One year                  3937 non-null   uint8
 21  contract_type_Two year                  3937 non-null   uint8
 22  payment_type_Bank transfer (automatic)  3937 non-null   uint8
 23  payment_type_Credit card (automatic)    3937 non-null   uint8
 24  payment_type_Electronic check           3937 non-null   uint8
 25  payment_type_Mailed check               3937 non-null   uint8
 26  internet_service_type_DSL               3937 non-null   uint8
 27  internet_service_type_Fiber optic       3937 non-null   uint8
 28  internet_service_type_None              3937 non-null   uint8
dtypes: float64(2), int64(7), object(5), uint8(15)
memory usage: 519.0+ KB

In [206]:
validate.info()
# no nulls, check

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1688 entries, 816 to 3718
Data columns (total 29 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   gender                                  1688 non-null   object
 1   senior_citizen                          1688 non-null   int64
 2   partner                                 1688 non-null   int64
 3   dependents                              1688 non-null   int64
 4   tenure                                  1688 non-null   int64
 5   phone_service                           1688 non-null   int64
 6   multiple_lines                          1688 non-null   object
 7   paperless_billing                       1688 non-null   int64
 8   monthly_charges                         1688 non-null   float64
 9   total_charges                           1688 non-null   float64
 10  churn                                   1688 non-null   int64
 11  contract_type                           1688 non-null   object
 12  payment_type                            1688 non-null   object
 13  internet_service_type                   1688 non-null   object
 14  gender_Female                           1688 non-null   uint8
 15  gender_Male                             1688 non-null   uint8
 16  multiple_lines_No                       1688 non-null   uint8
 17  multiple_lines_No phone service         1688 non-null   uint8
 18  multiple_lines_Yes                      1688 non-null   uint8
 19  contract_type_Month-to-month            1688 non-null   uint8
 20  contract_type_One year                  1688 non-null   uint8
 21  contract_type_Two year                  1688 non-null   uint8
 22  payment_type_Bank transfer (automatic)  1688 non-null   uint8
 23  payment_type_Credit card (automatic)    1688 non-null   uint8
 24  payment_type_Electronic check           1688 non-null   uint8
 25  payment_type_Mailed check               1688 non-null   uint8
 26  internet_service_type_DSL               1688 non-null   uint8
 27  internet_service_type_Fiber optic       1688 non-null   uint8
 28  internet_service_type_None              1688 non-null   uint8
dtypes: float64(2), int64(7), object(5), uint8(15)
memory usage: 222.5+ KB

In [209]:
test.info()
# no nulls, check

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1407 entries, 3311 to 3690
Data columns (total 29 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   gender                                  1407 non-null   object
 1   senior_citizen                          1407 non-null   int64
 2   partner                                 1407 non-null   int64
 3   dependents                              1407 non-null   int64
 4   tenure                                  1407 non-null   int64
 5   phone_service                           1407 non-null   int64
 6   multiple_lines                          1407 non-null   object
 7   paperless_billing                       1407 non-null   int64
 8   monthly_charges                         1407 non-null   float64
 9   total_charges                           1407 non-null   float64
 10  churn                                   1407 non-null   int64
 11  contract_type                           1407 non-null   object
 12  payment_type                            1407 non-null   object
 13  internet_service_type                   1407 non-null   object
 14  gender_Female                           1407 non-null   uint8
 15  gender_Male                             1407 non-null   uint8
 16  multiple_lines_No                       1407 non-null   uint8
 17  multiple_lines_No phone service         1407 non-null   uint8
 18  multiple_lines_Yes                      1407 non-null   uint8
 19  contract_type_Month-to-month            1407 non-null   uint8
 20  contract_type_One year                  1407 non-null   uint8
 21  contract_type_Two year                  1407 non-null   uint8
 22  payment_type_Bank transfer (automatic)  1407 non-null   uint8
 23  payment_type_Credit card (automatic)    1407 non-null   uint8
 24  payment_type_Electronic check           1407 non-null   uint8
 25  payment_type_Mailed check               1407 non-null   uint8
 26  internet_service_type_DSL               1407 non-null   uint8
 27  internet_service_type_Fiber optic       1407 non-null   uint8
 28  internet_service_type_None              1407 non-null   uint8
dtypes: float64(2), int64(7), object(5), uint8(15)
memory usage: 185.5+ KB

# Takeaways
- Using train, test, validate helps split the data into categories for machine learning
- cleaning the data and then preparing them for entry into a machine learning model is best practice.